{
  "backend/main.mo": "Defines core actor logic for user profiles, jobs, chat, payouts, applications, and access control with helper functions for roles and job participation.",
  "feature_evidence.json": "Contains feature evidence metadata mapping PWA-related UI features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Lists brief summaries of major frontend files including hooks, pages, components, and PWA-related utilities.",
  "frontend/index.css": "Defines Tailwind base styles and theme variables for light and dark modes using an OKLCH color system.",
  "frontend/index.html": "HTML entrypoint configuring PWA metadata, icons, manifest loading, and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying name, icons, colors, start URL, and display settings for JobConnect.",
  "frontend/public/offline.html": "Standalone offline fallback page informing users of connectivity loss with a retry button.",
  "frontend/public/sw.js": "Service worker implementing caching, offline support, and network-first fetch handling for PWA functionality.",
  "frontend/src/App.tsx": "Main React application with routing, authentication flow, service worker registration, and global PWA install provider.",
  "frontend/src/components/AppLayout.tsx": "Wraps the app with layout elements including offline banner, navbar, main content container, and footer.",
  "frontend/src/components/LoginButton.tsx": "Provides login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/NavBar.tsx": "Renders authenticated navigation with links, PWA install trigger, and a mobile menu sheet.",
  "frontend/src/components/OfflineBanner.tsx": "Displays an alert banner when the browser goes offline by listening to online/offline events.",
  "frontend/src/components/pwa/InstallInstructionsDialog.tsx": "Shows platform-specific PWA installation instructions with copyable app URL and tabbed content.",
  "frontend/src/components/pwa/PwaInstallProvider.tsx": "Manages PWA install prompts, detects installation state, and exposes install actions with a fallback dialog.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Combines identity, actor, and profile queries to derive current user state and role flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/usePwaInstall.ts": "Simple hook exposing the PWA install context from PwaInstallProvider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, jobs, applications, chat messages, and payouts via the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles and custom CSS variables for light/dark themes, safe-area padding, and mobile tap target improvements.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AuthPage.tsx": "Displays a login screen using Internet Identity and redirects authenticated users to the home page.",
  "frontend/src/pages/ChatPage.tsx": "Provides a chat interface for job participants, loading messages, sending new ones, and showing conversation history.",
  "frontend/src/pages/CreateJobPage.tsx": "Form page for job owners to create new jobs with validation and submission via the createJob mutation.",
  "frontend/src/pages/HomePage.tsx": "Shows a personalized dashboard summarizing jobs, applications, and actions based on the user’s role.",
  "frontend/src/pages/JobDetailsPage.tsx": "Displays detailed job info, handles applying, assigning workers, completing jobs, rating owners, and marking payouts as paid.",
  "frontend/src/pages/JobListPage.tsx": "Shows a filtered list of jobs, separating owner-managed jobs from open jobs and displaying basic job metadata.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user profile editing, displays job and payout stats, and supports PWA install and principal copying.",
  "frontend/src/pages/RoleSelectPage.tsx": "Allows new users to enter profile details and choose a role before saving their initial profile.",
  "frontend/src/pages/SplashPage.tsx": "Landing page that lets users log in, install the PWA, and view introductory information before entering the app.",
  "frontend/src/utils/pwaInstall.ts": "Provides helper functions for detecting platform, checking PWA installation state, and copying text to clipboard.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s PWA-related goals, existing features, and pending requests for adding install support and instructions."
}