{
  "backend/main.mo": "Defines the core backend actor with user profiles, jobs, applications, chat, payouts, access control, and helper logic for role checks and job participation.",
  "backend/migration.mo": "Handles state migration by adding phone numbers to profiles and workersNeeded to jobs while preserving existing data maps.",
  "feature_evidence.json": "Lists feature evidence mapping features to frontend files, components, and test IDs for tracking implementation status.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend files, including pages, hooks, and components.",
  "frontend/index.css": "Defines global Tailwind CSS variables and styles using a warm OKLCH color palette with light and dark mode support.",
  "frontend/index.html": "Basic HTML entrypoint that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and root authentication/role-selection flow wrapped in a themed application container.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper with navbar, main content container, and footer including the caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Authentication button using Internet Identity with login/logout handling and React Query cache clearing.",
  "frontend/src/components/NavBar.tsx": "Role-aware navigation bar showing links for home, jobs, profile, and owner-only job creation, plus login/logout.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Combines identity, actor, and profile queries to expose the current user, role, and loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for Internet Identity authentication, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, jobs, applications, chat messages, and payouts via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom warm-themed CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AuthPage.tsx": "Login page that prompts users to authenticate with Internet Identity and redirects when logged in.",
  "frontend/src/pages/ChatPage.tsx": "Displays job-specific chat messages and allows sending messages between job owners and workers.",
  "frontend/src/pages/CreateJobPage.tsx": "Form page for owners to create new jobs with validation and backend submission.",
  "frontend/src/pages/HomePage.tsx": "Dashboard showing personalized job stats for owners and workers and links to manage or explore jobs.",
  "frontend/src/pages/JobDetailsPage.tsx": "Displays full job details, applications, actions like apply/assign/complete, and rating and payout handling.",
  "frontend/src/pages/JobListPage.tsx": "Lists jobs filtered by user role, showing status, pay, and key job info with navigation to details.",
  "frontend/src/pages/ProfilePage.tsx": "User profile viewer/editor with job activity stats, payout info, and principal copying.",
  "frontend/src/pages/RoleSelectPage.tsx": "Initial profile setup page for choosing name, phone, and user role before onboarding.",
  "frontend/src/pages/SplashPage.tsx": "Landing page introducing the app with branding and login flow kickoff via Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning values from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, spacing, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state metadata, architectural notes, features, and requirements for a two‑sided job marketplace app."
}