{
  "kind": "build_request",
  "title": "Add user-facing install/download link and PWA install instructions for cantering-7xu.caffeine.xyz",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an install/download entry point in the UI that lets users install the PWA for cantering-7xu.caffeine.xyz from the browser, including a visible \"Install app\" button on the unauthenticated landing (Splash) screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create me this link to app to download cantering-7xu.caffeine.xyz"
        ]
      },
      "acceptanceCriteria": [
        "When visiting the app while logged out, SplashPage shows a clearly labeled \"Install app\" button in addition to \"Get Started\".",
        "On supported browsers (e.g., Chrome/Edge), clicking \"Install app\" triggers the native PWA install prompt when available (using the beforeinstallprompt flow).",
        "If the native install prompt is not available (e.g., iOS Safari), clicking \"Install app\" opens an instructions UI instead of failing silently."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Provide an install instructions UI (modal/drawer/page) with English step-by-step instructions for Android (Chrome), iPhone/iPad (Safari), and desktop (Chrome/Edge), and include a copyable URL string for \"https://cantering-7xu.caffeine.xyz\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create me this link to app to download cantering-7xu.caffeine.xyz"
        ]
      },
      "acceptanceCriteria": [
        "The instructions UI contains separate sections for Android, iOS, and Desktop with clear steps (e.g., \"Share\" → \"Add to Home Screen\" on iOS).",
        "The UI displays the full URL \"https://cantering-7xu.caffeine.xyz\" and provides a one-click copy action with a confirmation message.",
        "If the install prompt is available, the UI still offers a fallback link to view instructions."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the PWA install UX is reachable for both unauthenticated and authenticated users (e.g., from SplashPage for logged-out users and from an authenticated navigation location such as the mobile menu or Profile page for logged-in users).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create me this link to app to download cantering-7xu.caffeine.xyz"
        ]
      },
      "acceptanceCriteria": [
        "Logged-in users can access the same install instructions UI from within the app (without logging out).",
        "The install entry point does not break existing navigation/auth flows and works on both mobile and desktop layouts."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only Shadcn components); compose them instead.",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep all backend logic in the existing single Motoko actor (no new backend services)."
  ],
  "nonGoals": [
    "Implementing a native App Store / Google Play store download flow.",
    "Adding third-party analytics or external SDKs for install tracking.",
    "Changing the existing PWA manifest/service worker behavior unless required to support the new install/instructions UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}