{
  "kind": "build_request",
  "title": "Add phone number to registration/profile and add workers-needed field to jobs",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Add a phone number field to the user profile data model and persist it per authenticated Principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Pls add aa phone number to register"
        ]
      },
      "acceptanceCriteria": [
        "`UserProfile` in `backend/main.mo` includes a phone number field (stored with each profile).",
        "`saveCallerUserProfile` stores the caller’s phone number in the profile record.",
        "`getCallerUserProfile` / `getUserProfile` return the phone number field as part of the profile."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Collect and validate a phone number during the profile creation/registration flow (Role Select page) and send it to the backend when creating the profile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Pls add aa phone number to register"
        ]
      },
      "acceptanceCriteria": [
        "RoleSelectPage shows an additional input labeled \"Phone Number\".",
        "Submitting the form without a phone number shows an English validation error and does not submit.",
        "The phone number value is passed through React Query (`useSaveCallerUserProfile`) to the backend save profile method.",
        "On success, the user proceeds as before (profile created and navigated to home)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Show the saved phone number on the Profile page and allow the user to edit and save it (alongside display name) using the same profile-save mechanism.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Pls add aa phone number to register"
        ]
      },
      "acceptanceCriteria": [
        "ProfilePage displays the current phone number when a profile exists.",
        "ProfilePage provides an edit UI that allows changing the phone number and saving it.",
        "Saving updates the backend profile and refreshes the `currentUserProfile` query so the updated phone number is shown."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Add a \"workersNeeded\" (how many workers are needed) field to the Job data model, store it for each job, and return it in job queries.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ower wants to select the how may workers want please add it"
        ]
      },
      "acceptanceCriteria": [
        "`Job` in `backend/main.mo` includes a `workersNeeded` field.",
        "`createJob` accepts a `workersNeeded` parameter and stores it on the created job.",
        "Backend validates `workersNeeded` is at least 1 (reject invalid values with a clear error).",
        "`getAllJobs` and `getJobById` include `workersNeeded` in returned job records."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Allow owners to select the number of workers needed when creating a job, submit it to the backend, and display it on job details (and anywhere job summary is shown where feasible).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ower wants to select the how may workers want please add it"
        ]
      },
      "acceptanceCriteria": [
        "CreateJobPage includes a required numeric input labeled \"Workers Needed\" with a minimum value of 1.",
        "Create job submission includes `workersNeeded` in the mutation payload and calls the updated backend method.",
        "JobDetailsPage displays the number of workers needed for the job in the job information section.",
        "If job list items already show job metadata, they also show workers needed (or the field is shown at least on Job Details, even if not added to list UI)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (`backend/main.mo`) with no additional backend services.",
    "Do not edit any files under `frontend/src/components/ui` or other `frontend.immutablePaths`; compose existing UI components instead.",
    "Keep existing job assignment behavior (currently assigns exactly one worker) unless explicitly requested otherwise."
  ],
  "nonGoals": [
    "Implementing true multi-worker assignment (assigning multiple workers to one job) or changing application/assignment logic beyond adding the `workersNeeded` field.",
    "Adding SMS/phone verification or any external messaging/telephony integration.",
    "Adding third-party authentication beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}