{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add PWA install entry points and install instructions UI for cantering-7xu.caffeine.xyz",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an unauthenticated SplashPage \"Install app\" button that triggers the native PWA install prompt when available, otherwise opens install instructions.",
      "acceptanceCriteria": [
        "When visiting the app while logged out, SplashPage shows a clearly labeled \"Install app\" button in addition to \"Get Started\".",
        "On supported browsers (e.g., Chrome/Edge), clicking \"Install app\" triggers the native PWA install prompt when available (using the beforeinstallprompt flow).",
        "If the native install prompt is not available (e.g., iOS Safari), clicking \"Install app\" opens an instructions UI instead of failing silently."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/pwa/PwaInstallProvider.tsx",
          "operation": "create",
          "description": "Create a single, app-wide PWA install controller that listens for the browser beforeinstallprompt event, tracks whether a native install prompt is available, exposes a \"requestInstall\" action, and controls visibility of the install instructions UI. Use shadcn-ui composable primitives for any UI it renders (e.g., Dialog/Sheet), without editing files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/usePwaInstall.ts",
          "operation": "create",
          "description": "Create a hook that exposes PWA install state/actions from the PwaInstallProvider (e.g., canPromptInstall, requestInstall(), openInstructions()). This should be usable from SplashPage and authenticated navigation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SplashPage.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled \"Install app\" button alongside the existing \"Get Started\" button. Wire the click handler to usePwaInstall(): if a native install prompt is available, trigger it; otherwise open the instructions UI (and ensure it never fails silently). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Provide an install instructions UI with Android/iOS/Desktop step-by-step guidance and a copyable https://cantering-7xu.caffeine.xyz URL.",
      "acceptanceCriteria": [
        "The instructions UI contains separate sections for Android, iOS, and Desktop with clear steps (e.g., \"Share\" → \"Add to Home Screen\" on iOS).",
        "The UI displays the full URL \"https://cantering-7xu.caffeine.xyz\" and provides a one-click copy action with a confirmation message.",
        "If the install prompt is available, the UI still offers a fallback link to view instructions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/pwa/InstallInstructionsDialog.tsx",
          "operation": "create",
          "description": "Implement an install instructions UI (modal or drawer) containing separate sections for Android (Chrome), iPhone/iPad (Safari), and Desktop (Chrome/Edge), plus a displayed \"https://cantering-7xu.caffeine.xyz\" string with a one-click copy action and confirmation feedback (use existing toast system). Compose with shadcn-ui components (e.g., Dialog/Sheet, Tabs/Accordion, Button, Input) without editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/pwaInstall.ts",
          "operation": "create",
          "description": "Add small utilities for PWA install UX (e.g., platform detection helpers for iOS Safari vs Android/desktop, and a safe clipboard copy helper) to keep UI components clean and ensure consistent copy-confirmation behavior."
        },
        {
          "path": "frontend/src/components/pwa/PwaInstallProvider.tsx",
          "operation": "modify",
          "description": "Wire the InstallInstructionsDialog into the provider so it can be opened from anywhere, including when the native prompt is available (as a fallback \"View instructions\" action). Ensure the provider exposes a way to open the dialog explicitly. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make PWA install UX reachable for both logged-out and logged-in users via authenticated navigation (mobile menu and/or Profile).",
      "acceptanceCriteria": [
        "Logged-in users can access the same install instructions UI from within the app (without logging out).",
        "The install entry point does not break existing navigation/auth flows and works on both mobile and desktop layouts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the application in PwaInstallProvider so install state and the shared instructions UI are available on both unauthenticated (SplashPage) and authenticated (AppLayout/NavBar/ProfilePage) surfaces. Ensure existing auth/role routing behavior remains unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/NavBar.tsx",
          "operation": "modify",
          "description": "Add an authenticated entry point to the install UX (at minimum in the mobile Sheet menu; optionally also in the desktop nav) that calls usePwaInstall() to either trigger native install or open instructions. Keep navigation intact and close the mobile menu after selection. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Add an \"Install app\" entry point within the authenticated Profile page that opens the same instructions UI (and triggers native prompt when available via usePwaInstall()). Ensure this integrates with existing layout and does not interfere with profile editing/copy principal interactions. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}